---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledLength
source: html/8c1426ed-4987-665a-0dad-01cd4e8605b7.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledLength Property

The length of the extrusion, scaled to the units of export.

## Syntax (C#)
```csharp
public double ScaledLength { get; set; }
```